eisup_2019_docmng_integration/src/Enums/абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ/абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</name>
  <enumValues>
    <name>ПлановыеЗначения</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаПлановыхЗначений</name>
  </enumValues>
  <enumValues>
    <name>ФактическиеЗначения</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаФактическихЗначений</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ВводЗначенийПоказателейДляРасчетаКПЭ/абс_ВводЗначенийПоказателейДляРасчетаКПЭ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ВводЗначенийПоказателейДляРасчетаКПЭ</name>
  <registerRecords>InformationRegister.абс_ЗначенияПоказателейДляРасчетаКПЭ</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодписанныйПлан</name>
    <type>
      <types>CatalogRef.ХранилищеДополнительнойИнформации</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.абс_СтатусыЗагрузкиКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерКорректировки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>8</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидПремии</name>
    <type>
      <types>EnumRef.абс_ВидыПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаИзмененияСтатуса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>CatalogRef.абс_ПоказателиДляПремий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРегистрации</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ЗначенияПоказателей</name>
    <attributes>
      <name>Период</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоказателя</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>4</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидАналитикиКПЭ</name>
      <type>
        <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/Catalogs/абс_ПоказателиДляПремий/абс_ПоказателиДляПремий.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>абс_ПоказателиДляПремий</name>
  <attributes>
    <name>ВидПоказателя</name>
    <type>
      <types>EnumRef.ВидыПоказателейСхемМотивации</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.абс_ВидыПоказателей</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстМодуля</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидВыполнения</name>
    <type>
      <types>EnumRef.абс_ВидыВыполненияМодулей</types>
    </type>
  </attributes>
  <attributes>
    <name>абс_ПоследнийИзменивший</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ЯвляетсяКПЭ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидАналитикиКПЭ</name>
    <type>
      <types>EnumRef.абс_ВидыАналитикиЗначенийПоказателейКПЭ</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормулаРасчетаКПЭ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоВыражение</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Запросы</name>
    <attributes>
      <name>ИмяЗапроса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>75</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТекстЗапроса</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

eisup_2019_docmng_integration/src/CommonModules/абс_РасчетПремийПоКПЭ/Module.bsl
Процедура ОткрытьФормуПоказателейКПЭ() Экспорт
	
	Форма = Справочники.абс_ПоказателиДляПремий.ПолучитьФорму("ФормаСписка");
	
	Форма.СправочникСписок.Отбор.ЯвляетсяКПЭ.Установить(Истина);
	
	Форма.ЭлементыФормы.СправочникСписок.НастройкаОтбора.ЯвляетсяКПЭ.Доступность = Ложь;
	
	Форма.ЭлементыФормы.СправочникСписок.Колонки.ВидПоказателя.Видимость = Ложь;
	Форма.ЭлементыФормы.СправочникСписок.Колонки.ТипПоказателя.Видимость = Ложь;
	Форма.ЭлементыФормы.СправочникСписок.Колонки.Идентификатор.Видимость = Ложь;
	
	Форма.КлючУникальности = "СправочникСписок.ПоказателиКПЭ";
	
	ОсновнаяОрганизация = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОсновнаяОрганизация");
	
	Если ЗначениеЗаполнено(ОсновнаяОрганизация) Тогда
		
		Форма.СправочникСписок.Отбор.Организация.Установить(ОсновнаяОрганизация);
		
	КонецЕсли;
	
	Форма.Открыть();
	
КонецПроцедуры

Процедура СформироватьДокументВводЗначенийПоказателейДляРасчетаКПЭПлановыеЗначения() Экспорт
	
	ПараметрыФормы = Новый Структура("ВидОперации",Перечисления.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.ПлановыеЗначения);
	ОткрытьФорму("Документ.абс_ВводЗначенийПоказателейДляРасчетаКПЭ.Форма.ФормаСписка",ПараметрыФормы,,"ВводЗначенийПоказателейДляРасчетаКПЭПлановыеЗначения");
	
КонецПроцедуры

Процедура СформироватьДокументВводЗначенийПоказателейДляРасчетаКПЭКорректировкаПлановыхЗначений() Экспорт
	
	ПараметрыФормы = Новый Структура("ВидОперации",Перечисления.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.КорректировкаПлановыхЗначений);
	ОткрытьФорму("Документ.абс_ВводЗначенийПоказателейДляРасчетаКПЭ.Форма.ФормаСписка",ПараметрыФормы,,"ВводЗначенийПоказателейДляРасчетаКПЭКорректировкаПлановыхЗначений");
	
КонецПроцедуры

Процедура СформироватьДокументВводЗначенийПоказателейДляРасчетаКПЭФактическиеЗначения() Экспорт
	
	ПараметрыФормы = Новый Структура("ВидОперации",Перечисления.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.ФактическиеЗначения);
	ОткрытьФорму("Документ.абс_ВводЗначенийПоказателейДляРасчетаКПЭ.Форма.ФормаСписка",ПараметрыФормы,,"ВводЗначенийПоказателейДляРасчетаКПЭФактическиеЗначения");
	
КонецПроцедуры

Процедура СформироватьДокументВводЗначенийПоказателейДляРасчетаКПЭКорректировкаФактическихЗначений() Экспорт
	
	ПараметрыФормы = Новый Структура("ВидОперации",Перечисления.абс_ВидыОперацийВводаЗначенийПоказателейДляРасчетаКПЭ.КорректировкаФактическихЗначений);
	ОткрытьФорму("Документ.абс_ВводЗначенийПоказателейДляРасчетаКПЭ.Форма.ФормаСписка",ПараметрыФормы,,"ВводЗначенийПоказателейДляРасчетаКПЭКорректировкаФактичскихЗначений");
	
КонецПроцедуры
